Dlubal.RFEM5.ActionCategoryType
Type of action category

Dlubal.RFEM5.ActionCategoryType.UnknownActionCategory
Unknown action category

Dlubal.RFEM5.ActionCategoryType.Permanent
Permanent

Dlubal.RFEM5.ActionCategoryType.Prestress
Prestress

Dlubal.RFEM5.ActionCategoryType.Imposed
Imposed

Dlubal.RFEM5.ActionCategoryType.TrafficLoads
Traffic loads

Dlubal.RFEM5.ActionCategoryType.SnowIce
Snow/Ice

Dlubal.RFEM5.ActionCategoryType.Wind
Wind

Dlubal.RFEM5.ActionCategoryType.TemperatureNonFire
Temperature (non fire)

Dlubal.RFEM5.ActionCategoryType.SettlementsOfFoundationSoil
Settlements of foundation soil

Dlubal.RFEM5.ActionCategoryType.OtherCategory
Other

Dlubal.RFEM5.ActionCategoryType.Accidental
Accidental

Dlubal.RFEM5.ActionCategoryType.Earthquake
Earthquake

Dlubal.RFEM5.ActionCategoryType.UserDefined
User-defined

Dlubal.RFEM5.ActionCategoryType.ImperfectionCategory
Imperfection

Dlubal.RFEM5.ActionCategoryType.PermanentSmallFluctuations
Permanent - small fluctuations

Dlubal.RFEM5.ActionCategoryType.WeightOfIce
Weight of Ice

Dlubal.RFEM5.ActionCategoryType.DeadLoad
Dead

Dlubal.RFEM5.ActionCategoryType.DeadLoadDL
Dead

Dlubal.RFEM5.ActionCategoryType.DeadLoadGK
Dead

Dlubal.RFEM5.ActionCategoryType.PermanentFromCranes
Permanent from Cranes

Dlubal.RFEM5.ActionCategoryType.PermanentImposed
Permanent/Imposed

Dlubal.RFEM5.ActionCategoryType.SelfStrainingForce
Self-Straining Force

Dlubal.RFEM5.ActionCategoryType.Variable
Variable

Dlubal.RFEM5.ActionCategoryType.Live
Live

Dlubal.RFEM5.ActionCategoryType.RoofLive
Roof Live

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryA
Imposed - category A: domestic, residential areas

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryB
Imposed - category B: office areas

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryC
Imposed - category C: congregation areas

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryD
Imposed - category D: shopping areas

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryE
Imposed - category E: storage areas

Dlubal.RFEM5.ActionCategoryType.ImposedLive
Imposed live

Dlubal.RFEM5.ActionCategoryType.ImposedLoad
Imposed

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryF
Imposed - category F: traffic area - vehicle weight ≤ 30 kN

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryG
Imposed - category G: traffic area - vehicle weight ≤ 160 kN

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryH
Imposed - category H: roofs

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryI
Imposed - category I: roofs - helicopter

Dlubal.RFEM5.ActionCategoryType.ImposedCategoryJ
Imposed - category I: roofs - heliport, equipment

Dlubal.RFEM5.ActionCategoryType.ImposedLoadsCategoryH
Imposed loads - Category H: inaccessible roofs

Dlubal.RFEM5.ActionCategoryType.ImposedLoadsCategoryK
Imposed loads - Category K: flat roofs - helicopter

Dlubal.RFEM5.ActionCategoryType.ImposedLoadsCategoryKOther
Imposed loads - Category K': flat roofs - other

Dlubal.RFEM5.ActionCategoryType.SnowIce2
Snow / ice

Dlubal.RFEM5.ActionCategoryType.SnowFinland
Finland, Iceland, Norway, Sweden

Dlubal.RFEM5.ActionCategoryType.SnowHGreaterThan1000
Snow (H > 1000 m a.s.l.

Dlubal.RFEM5.ActionCategoryType.ShowHLowerThan1000
Snow (H ≤ 1000 m a.s.l.

Dlubal.RFEM5.ActionCategoryType.SnowSKLowerThan275
Snow - s-k < 2.75 kN/m2

Dlubal.RFEM5.ActionCategoryType.SnowSKGreaterThan275
Snow - s-k ≥ 2.75 kN/m2

Dlubal.RFEM5.ActionCategoryType.SnowOutdoorSKLowerThan275
Snow - outdoor terraces and balconies - s-k < 2,75 kN/m2

Dlubal.RFEM5.ActionCategoryType.SnowOutdoorSKGreaterThan275
Snow - outdoor terraces and balconies - s-k ≥ 2,75 kN/m2

Dlubal.RFEM5.ActionCategoryType.Snow
Snow

Dlubal.RFEM5.ActionCategoryType.SnowSweden1
Snow - sk ≥ 3 kN/m2

Dlubal.RFEM5.ActionCategoryType.SnowSweden2
Snow - 2,0 ≤ sk < 3 kN/m2

Dlubal.RFEM5.ActionCategoryType.SnowSweden3
Snow - 1,0 ≤ sk < 2 kN/m2

Dlubal.RFEM5.ActionCategoryType.SnowSaintPierreEtMiquelon
Snow - region Saint-Pierre-et-Miquelon

Dlubal.RFEM5.ActionCategoryType.SnowIceRain
Snow, ice and rain

Dlubal.RFEM5.ActionCategoryType.WindLoad
Wind

Dlubal.RFEM5.ActionCategoryType.WindOnIce
Wind on ice

Dlubal.RFEM5.ActionCategoryType.WindLiveLoad
Wind

Dlubal.RFEM5.ActionCategoryType.WindWL
Wind

Dlubal.RFEM5.ActionCategoryType.WindWK
Wind

Dlubal.RFEM5.ActionCategoryType.UniformTemperatures
Uniform Temperatures, Shrinkage

Dlubal.RFEM5.ActionCategoryType.TemperatureShrinkageCreep
Temperature, shrinkage, creep etc.

Dlubal.RFEM5.ActionCategoryType.PermanentFromSoilEarthLoad
Permanent from Soil - Earth Load

Dlubal.RFEM5.ActionCategoryType.PermanentFromSoilEarthPressure
Permanent from Soil - Earth Pressure

Dlubal.RFEM5.ActionCategoryType.PermanentFromSoilWaterPressure
Permanent from Soil - Water Pressure

Dlubal.RFEM5.ActionCategoryType.VariableFromSoilEarthPressure
Variable from Soil - Earth Pressure

Dlubal.RFEM5.ActionCategoryType.VariableFromSoilWaterPressure
Variable from Soil - Water Pressure

Dlubal.RFEM5.ActionCategoryType.LateralEarthWaterPressure
Lateral Earth Pressure

Dlubal.RFEM5.ActionCategoryType.LateralEarthPressure
Lateral Earth Pressure

Dlubal.RFEM5.ActionCategoryType.Fluids
Fluids - Well-defined

Dlubal.RFEM5.ActionCategoryType.Flood
Flood

Dlubal.RFEM5.ActionCategoryType.Rain
Rain

Dlubal.RFEM5.ActionCategoryType.CraneLoad
Crane load

Dlubal.RFEM5.ActionCategoryType.ErectionLoad
Erection

Dlubal.RFEM5.ActionCategoryType.NotionalHorizontalForces
Notional Horizontal Forces

Dlubal.RFEM5.ActionCategoryType.ActionsDuringExecution
Actions during execution

Dlubal.RFEM5.ActionCategoryType.AccidentalLoad
Accidental

Dlubal.RFEM5.ActionCategoryType.EarthquakeLoadE
Earthquake

Dlubal.RFEM5.ActionCategoryType.EarthquakeLiveLoad
Earthquake

Dlubal.RFEM5.ActionCategoryType.EarthquakeLoadEL
Earthquake

Dlubal.RFEM5.ActionCategoryType.GbPermanent
Permanent

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings211
Civil buildings: dwelling, hostel, hotel, office, hospital ward

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings212
Civil buildings: classroom, laboratory, reading room, meeting room

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings22
Civil buildings: canteen, dining hall, ordinary archives

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings231
Civil buildings: assembly hall, theater, cinema

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings232
Civil buildings: laundry

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings241
Civil buildings: stores and shops, exhibition halls, station, port, airport

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings242
Civil buildings: stands without fixed seat

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings251
Civil buildings: gymnasium, arena

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings252
Civil buildings: dance hall

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings261
Civil buildings: storehouse for collecting books, archives, storerooms

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings262
Civil buildings: warehouse with a dense concentration of shelving

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings27
Civil buildings: ventilator motor room, elevator motor room

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings281
Civil buildings: automobile passage and garage, one-way slab floor

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings282
Civil buildings: automobile passage and garage, two-way slab roof

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings291
Civil buildings: kitchen ordinary

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings292
Civil buildings: kitchen for dining hall

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2101
Civil buildings: bathroom, toilet and washroom, buildings in item No.1

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2102
Civil buildings: bathroom, toilet and washroom, for other buildings

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2111
Civil buildings: passage, entrance hall, staircase - hostel, hotel, nursery

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2112
Civil buildings: passage, entrance hall, staircase - office, classroom

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2113
Civil buildings: passage, entrance hall, staircase - thick stream of people

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2121
Civil buildings: balcony, ordinary

Dlubal.RFEM5.ActionCategoryType.GbCivilBuildings2122
Civil buildings: balcony, population may be concentrated

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding31
Industrial buildings: metal working workshop

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding321
Industrial buildings: manufacturing workshop, Table C.0.2, Item No.1,2,4,6

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding322
Industrial buildings: manufacturing workshop, Table C.0.2, Item No.3,5

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding323
Industrial buildings: manufacturing workshop, Table C.0.2, Item No.7,8

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding33
Industrial buildings: Semiconductor production workshop

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding34
Industrial buildings: Cotton milling workshop

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding35
Industrial buildings: Preparatory workshop for tire plant

Dlubal.RFEM5.ActionCategoryType.GbIndustrialBuilding36
Industrial buildings: Grain processing workshop

Dlubal.RFEM5.ActionCategoryType.GbLiveLoadsOnRoofs41
Live loads on roofs: unmanned roof

Dlubal.RFEM5.ActionCategoryType.GbLiveLoadsOnRoofs42
Live loads on roofs: manned roof

Dlubal.RFEM5.ActionCategoryType.GbLiveLoadsOnRoofs43
Live loads on roofs: roof garden

Dlubal.RFEM5.ActionCategoryType.GbLiveLoadsOnRoofs44
Live loads on roofs: helicopter on the roof

Dlubal.RFEM5.ActionCategoryType.GbAshLoadOnRoofings51
Ash load on roofings, Table 4.4.1-1

Dlubal.RFEM5.ActionCategoryType.GbAshLoadOnRoofings52
Ash load on roofings, Table 4.4.1-2

Dlubal.RFEM5.ActionCategoryType.GbCraneLoads61
Crane loads: working grades A1 - A3

Dlubal.RFEM5.ActionCategoryType.GbCraneLoads62
Crane loads: working grades A6, A7

Dlubal.RFEM5.ActionCategoryType.GbCraneLoads63
Crane loads: working grades A4, A5

Dlubal.RFEM5.ActionCategoryType.GbCraneLoads64
Crane loads: lifting hook cranes of working grade A8

Dlubal.RFEM5.ActionCategoryType.GbSnowLoadZone1
Snow load: zone I

Dlubal.RFEM5.ActionCategoryType.GbSnowLoadZone2
Snow load: zone II

Dlubal.RFEM5.ActionCategoryType.GbSnowLoadZone3
Snow load: zone III

Dlubal.RFEM5.ActionCategoryType.GbWindLoadSccordingTo714
Wind load according to 7.1.4

Dlubal.RFEM5.ActionCategoryType.GbAccidentalActions
Accidental Actions

Dlubal.RFEM5.ActionCategoryType.GbSeismic
Seismic

Dlubal.RFEM5.ActionCategoryType.UnevenSettlements
Uneven settlements

Dlubal.RFEM5.ActionCategoryType.Gr1A
gr1a - LM1 + pedestrian + cycle track

Dlubal.RFEM5.ActionCategoryType.Gr1B
gr1b - LM2 - single axle

Dlubal.RFEM5.ActionCategoryType.Gr2
gr2 - Horizontal forces + LM1

Dlubal.RFEM5.ActionCategoryType.Gr3
gr3 - Pedestrian load

Dlubal.RFEM5.ActionCategoryType.Gr4
gr4 - LM4 - Crowd loading + pedestrian load

Dlubal.RFEM5.ActionCategoryType.Gr5
gr5 - LM3 - Special vehicles + LM1

Dlubal.RFEM5.ActionCategoryType.WindLoadsFwkPersistentDesignSituations
Wind loads - Fwk - Persistent design situations

Dlubal.RFEM5.ActionCategoryType.WindLoadsFwkExecution
Wind loads - Fwk - Execution

Dlubal.RFEM5.ActionCategoryType.WindLoadsFw
Wind loads - Fw''

Dlubal.RFEM5.ActionCategoryType.ConstructionLoadsDueToWorkingPersonnel
Construction loads due to working personnel

Dlubal.RFEM5.ActionCategoryType.OtherConstructionLoads
Other construction loads

Dlubal.RFEM5.ActionCategoryType.ImposedFromCranesCategoryA
Imposed from Cranes - category A: Class 1-7

Dlubal.RFEM5.ActionCategoryType.ImposedFromCranesCategoryB
Imposed from Cranes - category B: Class 8

Dlubal.RFEM5.ActionCategoryType.ImposedFromCranesCategoryC
Imposed from Cranes - category C: Class 9, 10

Dlubal.RFEM5.ActionCategoryType.ImposedFromCranesCategoryD
Imposed from Cranes - category D: Class 11, 12, 13

Dlubal.RFEM5.ActionCategoryType.ImposedFromCranesGeneral
Imposed from Cranes - general

Dlubal.RFEM5.ActionCategoryType.PipingSelfWeight
Piping: Self weight

Dlubal.RFEM5.ActionCategoryType.PipingFluid
Piping: Fluid

Dlubal.RFEM5.ActionCategoryType.PipingFluidPressureTest
Piping: Fluid - Pressure Test

Dlubal.RFEM5.ActionCategoryType.PipingTemperature
Piping: Temperature

Dlubal.RFEM5.ActionCategoryType.PipingPressure
Piping: Pressure

Dlubal.RFEM5.ActionCategoryType.PipingTestPressure
Piping: Test Pressure

Dlubal.RFEM5.ActionCategoryType.PipingDisplacement
Piping: Displacement

Dlubal.RFEM5.ActionCategoryType.PipingHangerCategory
Piping: Hanger

Dlubal.RFEM5.ActionCategoryType.PipingColdSpring
Piping: Cold spring

Dlubal.RFEM5.ActionCategoryType.FormFindingResults
FORM-FINDING results

Dlubal.RFEM5.ActionCategoryType.Nbr1A
NBR 8681 1.A - Self-weight of metal structures

Dlubal.RFEM5.ActionCategoryType.Nbr1B
NBR 8681 1.B - Self-weight of prefabricated structures

Dlubal.RFEM5.ActionCategoryType.Nbr1C
NBR 8681 1.C - Self-weight of structures built on site

Dlubal.RFEM5.ActionCategoryType.Nbr1D
NBR 8681 1.D - Industrialized construction elements

Dlubal.RFEM5.ActionCategoryType.Nbr1E
NBR 8681 1.E - Industrialized construction elements with addition on site

Dlubal.RFEM5.ActionCategoryType.Nbr1F
NBR 8681 1.F - General construction elements and equipment

Dlubal.RFEM5.ActionCategoryType.NbrSettlements
NBR 8681 - Settlements of supports, shrinkage

Dlubal.RFEM5.ActionCategoryType.NbrActionsMaxValues
NBR 8681 - Actions with limited maximum values

Dlubal.RFEM5.ActionCategoryType.NbrGeneralVariableActions
NBR 8681 - General variable actions

Dlubal.RFEM5.ActionCategoryType.NbrExceptional
NBR 8681 - Exceptional

Dlubal.RFEM5.ActionCategoryType.LoadArisingFromExtraordinaryEvent
Load arising from extraordinary event